Terraform plan for __production__
<details>
<summary>Plan: 3 to add, 1 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_user_policy_attachment.eks_broker_policies["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_user_policy_attachment" "eks_broker_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + user       = "ssb-eks-broker"
    }

  # aws_iam_user_policy_attachment.eks_broker_policies["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_user_policy_attachment" "eks_broker_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + user       = "ssb-eks-broker"
    }

  # cloudfoundry_service_instance.solrcloud_broker_k8s_cluster will be created
  + resource "cloudfoundry_service_instance" "solrcloud_broker_k8s_cluster" {
      + id                             = (known after apply)
      + name                           = "ssb-solrcloud-k8s"
      + recursive_delete               = false
      + replace_on_params_change       = false
      + replace_on_service_plan_change = false
      + service_plan                   = "07996909-c99a-4f7b-b154-4330e363693b"
      + space                          = "9a1db116-0180-42be-8ffa-7944dcf6bf50"
      + tags                           = [
          + "k8s",
        ]

      + timeouts {
          + create = "60m"
          + delete = "40m"
          + update = "90m"
        }
    }

  # module.broker_solrcloud.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
      ~ environment                = (sensitive value)
        id                         = "af39659f-d54f-4132-bf93-6766d8efaa09"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-solrcloud"
        # (18 unchanged attributes hidden)


      + service_binding {
          + service_instance = (known after apply)
        }
        # (2 unchanged blocks hidden)
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [plan #148](https://github.com/GSA/datagov-ssb/actions/runs/1822950708)